**Terraform Format and Style🖌** `success`
**Terraform Initialization ⚙️** `success`
**Terraform Plan 📖** `success`
**Terraform Validation 🤖** `success`

<details><summary>Show Plan</summary>

```hcl
module.aws_fastmail_wtmn_net.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_witteman_me.data.dns_a_record_set.mail: Reading...
module.aws_github_pages_georgewitteman_com.data.dns_a_record_set.github_pages: Reading...
module.aws_fastmail_georgewitteman_com.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_georgewitteman_me.data.dns_a_record_set.mail: Reading...
data.github_user.georgewitteman: Reading...
data.github_repository.terraform: Reading...
data.tls_certificate.github: Reading...
module.aws_github_pages_georgewitteman_com.data.dns_a_record_set.github_pages: Read complete after 0s [id=georgewitteman.github.io]
module.aws_fastmail_georgewitteman_com.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_witteman_me.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_georgewitteman_me.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_wtmn_net.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
data.tls_certificate.github: Read complete after 0s [id=2f98b9dddcf0778622dc6788373a7f8c02e3a2c3]
data.github_repository.terraform: Read complete after 0s [id=terraform]
data.github_user.georgewitteman: Read complete after 0s [id=5918935]
aws_route53_zone.marcywitteman_com: Refreshing state... [id=Z0939016Z0WL8RV5A0D1]
aws_route53_zone.witteman_test_com: Refreshing state... [id=Z00288031C5HWCGKS61C1]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::866631827662:oidc-provider/token.actions.githubusercontent.com]
aws_vpc.this: Refreshing state... [id=vpc-0f2a94dfd7ea9bd38]
aws_route53_zone.wtmn_link: Refreshing state... [id=Z00895442NYDSZPLVH1X]
aws_route53_zone.georgewitteman_me: Refreshing state... [id=Z0431101102WXYNRXVF0T]
aws_key_pair.georgewitteman[0]: Refreshing state... [id=georgewitteman-personal]
aws_route53_zone.witteman_me: Refreshing state... [id=Z05063061CYA524JAU8BC]
aws_kms_key.dynamo_db_kms: Refreshing state... [id=1a1ca031-daf5-4f17-aa7d-2d2d2ca5a865]
data.aws_availability_zones.available: Reading...
aws_route53_zone.georgewitteman_com: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
aws_s3_bucket.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_route53_zone.wtmn_net: Refreshing state... [id=Z093069418CSBZIY3FKFL]
aws_s3_bucket.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_kms_key.primary_kms_key: Refreshing state... [id=d5eef806-22ba-4f53-a96f-3d3e6e545e07]
data.aws_iam_policy_document.github_oidc: Reading...
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-locks]
data.aws_iam_policy_document.github_oidc: Read complete after 0s [id=1151702415]
aws_route53_record.georgewitteman_me_txt: Refreshing state... [id=Z0431101102WXYNRXVF0T__TXT]
aws_route53_record.witteman_me_txt: Refreshing state... [id=Z05063061CYA524JAU8BC__TXT]
aws_iam_role.github_oidc: Refreshing state... [id=GitHubActionsOIDC]
aws_route53domains_registered_domain.witteman_test_com: Refreshing state... [id=witteman-test.com]
aws_route53_record.georgewitteman_com_txt: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__TXT]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dmarc[0]: Refreshing state... [id=Z0431101102WXYNRXVF0T__dmarc_TXT]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_caldavs: Refreshing state... [id=Z0431101102WXYNRXVF0T__caldavs._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_carddav: Refreshing state... [id=Z0431101102WXYNRXVF0T__carddav._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_submission: Refreshing state... [id=Z0431101102WXYNRXVF0T__submission._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_imap: Refreshing state... [id=Z0431101102WXYNRXVF0T__imap._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_pop3: Refreshing state... [id=Z0431101102WXYNRXVF0T__pop3._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_caldav: Refreshing state... [id=Z0431101102WXYNRXVF0T__caldav._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_pop3s: Refreshing state... [id=Z0431101102WXYNRXVF0T__pop3s._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_imaps: Refreshing state... [id=Z0431101102WXYNRXVF0T__imaps._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.mail: Refreshing state... [id=Z0431101102WXYNRXVF0T_mail_A]
module.aws_fastmail_georgewitteman_me.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_carddavs: Refreshing state... [id=Z0431101102WXYNRXVF0T__carddavs._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_jmap: Refreshing state... [id=Z0431101102WXYNRXVF0T__jmap._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.mx: Refreshing state... [id=Z0431101102WXYNRXVF0T__MX]
module.aws_fastmail_witteman_me.aws_route53_record.srv_caldav: Refreshing state... [id=Z05063061CYA524JAU8BC__caldav._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.mail: Refreshing state... [id=Z05063061CYA524JAU8BC_mail_A]
module.aws_fastmail_witteman_me.aws_route53_record.srv_carddav: Refreshing state... [id=Z05063061CYA524JAU8BC__carddav._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_pop3: Refreshing state... [id=Z05063061CYA524JAU8BC__pop3._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_carddavs: Refreshing state... [id=Z05063061CYA524JAU8BC__carddavs._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_imaps: Refreshing state... [id=Z05063061CYA524JAU8BC__imaps._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_caldavs: Refreshing state... [id=Z05063061CYA524JAU8BC__caldavs._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.mx: Refreshing state... [id=Z05063061CYA524JAU8BC__MX]
module.aws_fastmail_witteman_me.aws_route53_record.srv_imap: Refreshing state... [id=Z05063061CYA524JAU8BC__imap._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_jmap: Refreshing state... [id=Z05063061CYA524JAU8BC__jmap._tcp_SRV]
module.aws_fastmail_georgewitteman_me.data.aws_route53_zone.selected: Read complete after 0s [id=Z0431101102WXYNRXVF0T]
module.aws_fastmail_witteman_me.aws_route53_record.srv_submission: Refreshing state... [id=Z05063061CYA524JAU8BC__submission._tcp_SRV]
module.aws_fastmail_witteman_me.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_witteman_me.aws_route53_record.srv_pop3s: Refreshing state... [id=Z05063061CYA524JAU8BC__pop3s._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.dmarc[0]: Refreshing state... [id=Z05063061CYA524JAU8BC__dmarc_TXT]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_pop3s: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__pop3s._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_imap: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__imap._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_imaps: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__imaps._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_pop3: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__pop3._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.mail: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_mail_A]
module.aws_fastmail_georgewitteman_com.aws_route53_record.mx: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__MX]
module.aws_fastmail_georgewitteman_com.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_georgewitteman_com.aws_route53_record.dmarc[0]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__dmarc_TXT]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_caldavs: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__caldavs._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_caldav: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__caldav._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_carddav: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__carddav._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_jmap: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__jmap._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_submission: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__submission._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_carddavs: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__carddavs._tcp_SRV]
module.aws_github_pages_georgewitteman_com.aws_route53_record.this[""]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__A]
module.aws_fastmail_witteman_me.data.aws_route53_zone.selected: Read complete after 7s [id=Z05063061CYA524JAU8BC]
module.aws_github_pages_georgewitteman_com.aws_route53_record.this["www"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_www_A]
aws_route53_record.wtmn_net_txt: Refreshing state... [id=Z093069418CSBZIY3FKFL__TXT]
module.aws_fastmail_georgewitteman_com.data.aws_route53_zone.selected: Still reading... [10s elapsed]
module.aws_fastmail_georgewitteman_com.data.aws_route53_zone.selected: Read complete after 10s [id=Z04997513SHTSY0FZ1ZPN]
module.aws_squarespace_marcywitteman_com.aws_route53_record.a: Refreshing state... [id=Z0939016Z0WL8RV5A0D1__A]
module.aws_squarespace_marcywitteman_com.aws_route53_record.verify_cname: Refreshing state... [id=Z0939016Z0WL8RV5A0D1_ygcg8lysbebsftxsez6l_CNAME]
module.aws_squarespace_marcywitteman_com.aws_route53_record.www_cname: Refreshing state... [id=Z0939016Z0WL8RV5A0D1_www_CNAME]
aws_s3_bucket_versioning.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_acl.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs,log-delivery-write]
aws_s3_bucket_server_side_encryption_configuration.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_public_access_block.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_server_side_encryption_configuration.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_logging.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm1._domainkey_CNAME]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm2._domainkey_CNAME]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm3._domainkey_CNAME]
module.aws_short_io_wtmn_link.aws_route53_record.this: Refreshing state... [id=Z00895442NYDSZPLVH1X__A]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm1._domainkey_CNAME]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm2._domainkey_CNAME]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm3._domainkey_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_jmap: Refreshing state... [id=Z093069418CSBZIY3FKFL__jmap._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_pop3: Refreshing state... [id=Z093069418CSBZIY3FKFL__pop3._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_imaps: Refreshing state... [id=Z093069418CSBZIY3FKFL__imaps._tcp_SRV]
module.aws_fastmail_wtmn_net.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_wtmn_net.aws_route53_record.mx: Refreshing state... [id=Z093069418CSBZIY3FKFL__MX]
module.aws_fastmail_wtmn_net.aws_route53_record.dmarc[0]: Refreshing state... [id=Z093069418CSBZIY3FKFL__dmarc_TXT]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_caldavs: Refreshing state... [id=Z093069418CSBZIY3FKFL__caldavs._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_caldav: Refreshing state... [id=Z093069418CSBZIY3FKFL__caldav._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_submission: Refreshing state... [id=Z093069418CSBZIY3FKFL__submission._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_carddavs: Refreshing state... [id=Z093069418CSBZIY3FKFL__carddavs._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_carddav: Refreshing state... [id=Z093069418CSBZIY3FKFL__carddav._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.mail: Refreshing state... [id=Z093069418CSBZIY3FKFL_mail_A]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_pop3s: Refreshing state... [id=Z093069418CSBZIY3FKFL__pop3s._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_imap: Refreshing state... [id=Z093069418CSBZIY3FKFL__imap._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm2._domainkey_CNAME]
aws_subnet.public[0]: Refreshing state... [id=subnet-04f30421c9fb82c1a]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm3._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm1._domainkey_CNAME]
aws_subnet.private[0]: Refreshing state... [id=subnet-0ccfd17750c5d5506]
aws_subnet.public[1]: Refreshing state... [id=subnet-0b1aac25a65fa7319]
aws_subnet.public[2]: Refreshing state... [id=subnet-01bf6308e07cacbeb]
aws_subnet.private[1]: Refreshing state... [id=subnet-067756789ce7900ba]
aws_subnet.private[2]: Refreshing state... [id=subnet-0738390f6c76154c5]
module.aws_fastmail_wtmn_net.data.aws_route53_zone.selected: Read complete after 10s [id=Z093069418CSBZIY3FKFL]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm3._domainkey_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm2._domainkey_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm1._domainkey_CNAME]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_key_pair.georgewitteman[0] must be replaced
  # (moved from aws_key_pair.georgewitteman)
-/+ resource "aws_key_pair" "georgewitteman" {
      ~ arn             = "arn:aws:ec2:us-east-1:866631827662:key-pair/georgewitteman-personal" -> (known after apply)
      ~ fingerprint     = "ZOdKfTDHUURPwZIBpvDdZGu29HMQWCxlLhIHw04B5AQ=" -> (known after apply)
      ~ id              = "georgewitteman-personal" -> (known after apply)
      ~ key_name        = "georgewitteman-personal" -> "georgewitteman-personal-0" # forces replacement
      + key_name_prefix = (known after apply)
      ~ key_pair_id     = "key-08ca7e9c6de69483f" -> (known after apply)
      ~ key_type        = "ed25519" -> (known after apply)
      - tags            = {} -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @georgewitteman, Action: `pull_request`*